NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFM32PG23/EFM32PG23B310F512IM48.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VDAC0_NS</name>
      <version>1</version>
      <description>VDAC0_NS Registers</description>
      <baseAddress>0x59024000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VDAC</name>
        <value>55</value>
      </interrupt>
      <registers>
        <register>
          <name>IPVERSION</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPVERSION</name>
              <description>IPVERSION</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>No Description</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>VDAC Module Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLING</name>
              <description>Disablement busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRST</name>
          <description>No Description</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software reset command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESETTING</name>
              <description>Software reset busy status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>No Description</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0x7F773FBF</resetMask>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Differential Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLEENDED</name>
                  <description>Single ended output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFFERENTIAL</name>
                  <description>Differential output</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINEMODE</name>
              <description>Sine Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISSINEMODE</name>
                  <description>Sine mode disabled. Sine reset to 0 degrees</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENSINEMODE</name>
                  <description>Sine mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINERESET</name>
              <description>Sine Wave Reset When inactive</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0PRESCRST</name>
              <description>Channel 0 Start Reset Prescaler</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORESETPRESC</name>
                  <description>Prescaler not reset on channel 0 start</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESETPRESC</name>
                  <description>Prescaler reset on channel 0 start</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFRSEL</name>
              <description>Reference Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V125</name>
                  <description>Internal 1.25 V bandgap reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Internal 2.5 V bandgap reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>AVDD reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT</name>
                  <description>External pin reference</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>Prescaler Setting for DAC clock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEROVRFLOWPERIOD</name>
              <description>Internal Timer Overflow Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCLES2</name>
                  <description>The Timer overflows every 2 Prescaled CLK_DAC cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES4</name>
                  <description>The Timer overflows every 4 Prescaled CLK_DAC cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES8</name>
                  <description>The Timer overflows every 8 Prescaled CLK_DAC cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES16</name>
                  <description>The Timer overflows every 16 Prescaled CLK_DAC cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES32</name>
                  <description>The Timer overflows every 32 Prescaled CLK_DAC cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES64</name>
                  <description>The Timer overflows every 64 Prescaled CLK_DAC cycles</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFRESHPERIOD</name>
              <description>Refresh Timer Overflow Period</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCLES2</name>
                  <description>All channels with enabled refresh are refreshed every 2 CLK_REFRESH cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES4</name>
                  <description>All channels with enabled refresh are refreshed every 4 CLK_REFRESH cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES8</name>
                  <description>All channels with enabled refresh are refreshed every 8 CLK_REFRESH cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES16</name>
                  <description>All channels with enabled refresh are refreshed every 16 CLK_REFRESH cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES32</name>
                  <description>All channels with enabled refresh are refreshed every 32 CLK_REFRESH cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES64</name>
                  <description>All channels with enabled refresh are refreshed every 64 CLK_REFRESH cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES128</name>
                  <description>All channels with enabled refresh are refreshed every 128 CLK_REFRESH cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CYCLES256</name>
                  <description>All channels with enabled refresh are refreshed every 256 CLK_REFRESH cycles</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIASKEEPWARM</name>
              <description>Bias Keepwarm Mode Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAWU</name>
              <description>VDAC DMA Wakeup</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONDEMANDCLK</name>
              <description>Always allow clk_dac</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGHALT</name>
              <description>Debug Halt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Continue operation as normal during debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Complete the current conversion and then halt during debug mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WARMUPTIME</name>
              <description>DAC Warmup Time</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFCDBF333</resetMask>
          <fields>
            <field>
              <name>CH0ENS</name>
              <description>Channel 0 Enabled Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1ENS</name>
              <description>Channel 1 Enabled Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0WARM</name>
              <description>Channel 0 Warmed Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1WARM</name>
              <description>Channel 1 Warmed Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0FIFOFULL</name>
              <description>Channel 0 FIFO Full Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1FIFOFULL</name>
              <description>Channel 1 FIFO Full Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0FIFOCNT</name>
              <description>Channel 0 FIFO Valid Count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1FIFOCNT</name>
              <description>Channel 1 FIFO Valid Count</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0CURRENTSTATE</name>
              <description>Channel 0 Current Status</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1CURRENTSTATE</name>
              <description>Channel 1 Current Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0FIFOEMPTY</name>
              <description>Channel 0 FIFO Empty Status</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1FIFOEMPTY</name>
              <description>Channel 1 FIFO Empty Status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0FIFOFLBUSY</name>
              <description>CH0 WFIFO Flush Sync Busy</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1FIFOFLBUSY</name>
              <description>CH1 WFIFO Flush Sync Busy</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABUSINPUTCONFLICT</name>
              <description>ABUS Input Conflict Status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINEACTIVE</name>
              <description>Sine Wave Output Status on Channel</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABUSALLOCERR</name>
              <description>ABUS Allocation Error Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCBUSY</name>
              <description>Sync Busy Combined</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
